import numpy as np

#ফাংশন একটি সংখ্যা থেকে দশমিক অংশ কেটে ফেলে, শুধুমাত্র integer অংশ রাখে।
arr1 = np.trunc([-3.1666, 3.6667])
print(arr1)
 

#ফাংশন একটি সংখ্যা থেকে দশমিক অংশ কেটে ফেলে, শুধুমাত্র integer অংশ রাখে।
arr2 = np.fix([-3.1666, 3.6667])
print(arr2)

#arr → যেটা রাউন্ড করতে চাই (একটি সংখ্যা বা array)
#decimals → কয়টি দশমিক পর্যন্ত রাউন্ড করতে হবে (ডিফল্ট 0, অর্থাৎ integer)
arr3 = np.around([-3.1666, 3.6667], decimals=2)
print(arr3)

#সংখ্যাকে নিচের দিকের সবচেয়ে কাছের পূর্ণসংখ্যায় নামিয়ে আনা
arr4 = np.floor([-3.1666, 3.6667])#output: [-4.  3.]
print(arr4)

#সংখ্যাকে উপরের দিকে সবচেয়ে কাছের পূর্ণসংখ্যায় তুলতে ব্যবহার করা হয়
arr5 = np.ceil([-3.1666, 3.6667])#output: [-3.  4.]
print(arr5)
